app/controllers/articles_controller.rb

  def destroy
    @article = Article.find(params[:id]).destroy
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 9]]
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 9]]

  def update
    @article = Article.find(params[:id])
    @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 19]]
UPDATE "articles" SET "image_updated_at" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_updated_at", "2015-05-02 16:06:55.420236"], ["image_file_name", "Hubble_Deep_Field_South.jpg"], ["updated_at", "2015-05-02 16:06:55.790350"], ["id", 25]]